src/bsl/InformationRegisters/гкс_НастройкиНазначенияРазгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_НастройкиНазначенияРазгрузки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Силос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯмаРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочкаВъезда</Name>
					<Comment>Точка въезда</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СтруктураПЛК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Comment>ERP-1377</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СлужебнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_НастройкиНазначенияРазгрузки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текущую яму и сислос разгрузки номенклатуры по качеству
//
// Параметры:
//  ТочкаМаршрута  - СправочникСсылка.гкс_ТочкиМаршрута - ПЛК
//  ВидПеревозки  - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - Авто,ЖД и пр
//  Номенклатура  - СправочникСсылка.Номенклатура - номенклатура для разгрузки
//  СлужебнаяНоменклатура  - СправочникСсылка.Номенклатура - служебная номенклатура (сегмент качества)
//
// Возвращаемое значение:
//   Структура   - 
//		* ЯмаРазгрузки - СправочникСсылка.гкс_ТочкиМаршрута
//		* Силос - СправочникСсылка.гкс_ТочкиМаршрута
//
Функция ЯмаСилосРазгрузки(ТочкаМаршрута, ВидПеревозки, Номенклатура, СлужебнаяНоменклатура) Экспорт
	
	// инициализация выходной структуры
	Результат = Новый Структура("ЯмаРазгрузки, Силос");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиНазначенияРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	НастройкиНазначенияРазгрузки.Силос КАК Силос
	|ИЗ
	|	РегистрСведений.гкс_НастройкиНазначенияРазгрузки.СрезПоследних(
	|			,
	|			ТочкаМаршрута = &ТочкаМаршрута
	|				И ВидПеревозки = &ВидПеревозки
	|				И Номенклатура = &Номенклатура) КАК НастройкиНазначенияРазгрузки
	|ГДЕ
	|	НастройкиНазначенияРазгрузки.СлужебнаяНоменклатура = &СлужебнаяНоменклатура
	|	И НастройкиНазначенияРазгрузки.Действует";
			
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СлужебнаяНоменклатура", СлужебнаяНоменклатура);
		
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Иначе
		Результат = Неопределено;
	КонецЕсли;	
	
	Возврат Результат;

КонецФункции

#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

//#КонецОбласти

#КонецЕсли
